Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: །དེ་བཞིན་གཤེགས་པའི་དཔག་ཏུ་མེད་པའི་ཕྱིར་ཡང་སེམས་གནས་པར་མི་སྒོམ་མོ།
en: They do not abide in meditation for the sake of the unfathomability of the Tathāgata.

source: །དེ་བཞིན་གཤེགས་པའི་མཚུངས་པ་མེད་པའི་ཕྱིར་ཡང་སེམས་གནས་པར་མི་སྒོམ་མོ།
en: They do not abide in meditation for the sake of the peerlessness of the Tathāgata.

source: །དེ་བཞིན་གཤེགས་པའི་གྲངས་མེད་པའི་ཕྱིར་ཡང་སེམས་གནས་པར་མི་སྒོམ་མོ།
en: They do not abide in meditation for the sake of the infinitude of the Tathāgata.

source: །དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་དཔག་ཏུ་མེད་པ་དང་ལྡན་པའི་ཕྱིར་ཡང་སེམས་གནས་པར་མི་སྒོམ་མོ།
en: They do not abide in meditation for the sake of gaining the unfathomable qualities of the Tathāgata. “

source: །དེ་བཞིན་གཤེགས་པའི་མཚན་གྱི་ཕྱིར་ཡང་སེམས་སྐྱེད་པར་མི་འདོད་དོ།
en: They do not desire to generate the aspiration for awakening for the sake of the marks of the Tathāgata.

source: །དེ་བཞིན་གཤེགས་པའི་དཔེ་བྱད་བཟང་པོའི་ཕྱིར་ཡང་སེམས་སྐྱེད་པར་མི་འདོད་དོ།
en: They do not desire to generate the aspiration for the sake of the excellent minor marks of the Tathāgata.

source: །དེ་བཞིན་གཤེགས་པའི་བསམ་གྱིས་མི་ཁྱབ་པའི་གནས་ཀྱི་ཕྱིར་ཡང་སེམས་སྐྱེད་པར་མི་འདོད་དོ།
en: They do not desire to generate the aspiration for the sake of the inconceivable abodes of the Tathāgata.

source: །དེ་བཞིན་གཤེགས་པའི་དཔག་ཏུ་མེད་པའི་ཕྱིར་ཡང་སེམས་སྐྱེད་པར་མི་འདོད་དོ།
en: They do not desire to generate the aspiration for the sake of the unfathomability of the Tathāgata.

source: །དེ་བཞིན་གཤེགས་པའི་མཚུངས་པ་མེད་པའི་ཕྱིར་ཡང་སེམས་སྐྱེད་པར་མི་བྱེད་དོ།
en: They do not generate the aspiration for the sake of the peerlessness of the Tathāgata.

source: །དེ་བཞིན་གཤེགས་པའི་གྲངས་མེད་པའི་ཕྱིར་ཡང་སེམས་སྐྱེད་པར་མི་བྱེད་དོ།
en: They do not generate the aspiration for the sake of the infinitude of the Tathāgata.

source: །དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་དཔག་ཏུ་མེད་པ་དང་ལྡན་པའི་ཕྱིར་ཡང་སེམས་སྐྱེད་པར་མི་བྱེད་དོ།
en: They do not generate the aspiration for the sake of gaining the unfathomable qualities of the Tathāgata. “

source: །དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་དང་ཆོ་འཕྲུལ་གྱི་ཕྱིར་ཡང་ཚུལ་ཁྲིམས་མི་སྲུང་ངོ་།
en: They do not maintain discipline for the sake of the Tathāgata’s powers of magical manifestation and miraculous display.

source: །དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པའི་ཕྱིར་ཡང་ཚུལ་ཁྲིམས་མི་སྲུང་ངོ་།
en: They do not maintain discipline for the sake of the fearlessness of the Tathāgata.

source: །དེ་བཞིན་གཤེགས་པའི་གསང་བའི་ཕྱིར་ཡང་ཚུལ་ཁྲིམས་མི་སྲུང་ངོ་།
en: They do not maintain discipline for the sake of the secrets of the Tathāgata.

source: །དེ་བཞིན་གཤེགས་པའི་མཆོད་པའི་གནས་བླ་ན་མེད་པའི་ཕྱིར་ཡང་ཚུལ་ཁྲིམས་མི་སྲུང་ངོ་།
en: They do not maintain discipline for the sake of the unsurpassed venerability of the Tathāgata.

source: །དེ་བཞིན་གཤེགས་པའི་སྙིང་པོའི་ཕྱིར་ཡང་ཚུལ་ཁྲིམས་མི་སྲུང་གི་
en: They do not maintain discipline for the sake of the essence of the Tathāgata. “

source: སེམས་ཅན་ཐམས་ཅད་སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་ལས་ཐར་བར་འདོད་པའི་ཕྱིར་ཚུལ་ཁྲིམས་སྲུང་ངོ་།
en: Rather, they maintain discipline for the sake of liberating all sentient beings from birth, old age, sickness, death, sorrow, lamentation, suffering, unhappiness, and strife.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བདེ་བ་ཐོབ་པར་འདོད་པའི་ཕྱིར་ཚུལ་ཁྲིམས་སྲུང་ངོ་།
en: They maintain discipline out of the desire for all sentient beings to obtain happiness.

source: །སེམས་ཅན་ཐམས་ཅད་གྲུབ་པ་དང་བདེ་བར་འདོད་པའི་ཕྱིར་ཚུལ་ཁྲིམས་སྲུང་ངོ་།
en: They maintain discipline out of the desire for all sentient beings’ welfare.

source: །སེམས་ཅན་ཐམས་ཅད་བྱང་ཆུབ་ཀྱི་ཡོན་ཏན་ལ་དགོད་པར་འདོད་པའི་ཕྱིར་ཚུལ་ཁྲིམས་སྲུང་ངོ་།
en: They maintain discipline out of the desire for all sentient beings to establish the bodhisattva qualities.

source: །སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་སུ་བསྒྲུབ་པར་འདོད་པའི་ཕྱིར་ཚུལ་ཁྲིམས་སྲུང་ངོ་།
en: They maintain discipline out of the desire for all sentient beings to accomplish buddhahood.

source: །སེམས་ཅན་ཐམས་ཅད་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་དུ་གཞུག་པར་འདོད་པའི་ཕྱིར་ཚུལ་ཁྲིམས་སྲུང་ངོ་།
en: They maintain discipline out of the desire for all sentient beings to engage in turning the wheel of Dharma.

source: །སེམས་ཅན་ཐམས་ཅད་འཕགས་པའི་དགེ་འདུན་ཡོངས་སུ་སྡུད་དུ་གཞུག་པར་འདོད་པའི་ཕྱིར་ཚུལ་ཁྲིམས་སྲུང་ངོ་།
en: They maintain discipline out of the desire for all sentient beings to join the noble saṅgha.

source: །སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་གདུང་མི་འཆད་པར་བྱ་བར་འདོད་པའི་ཕྱིར་ཚུལ་ཁྲིམས་སྲུང་ངོ་།
en: They maintain discipline out of the desire for all sentient beings to continue the lineage of the buddhas.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་ཀྱི་རྒྱུན་མི་གཅད་པར་བྱ་བར་འདོད་པའི་ཕྱིར་ཚུལ་ཁྲིམས་སྲུང་ངོ་།
en: They maintain discipline out of the desire for the Dharma to flow uninterrupted among all sentient beings.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་དགེ་འདུན་གྱི་རིགས་བསྒྲུབ་པའི་ཕྱིར་ཚུལ་ཁྲིམས་སྲུང་ངོ་།
en: They maintain discipline for the sake of establishing the family of the saṅgha among all sentient beings.

source: །སེམས་ཅན་ཐམས་ཅད་ལ་ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་བསྒྲུབ་པར་འདོད་པའི་ཕྱིར་ཚུལ་ཁྲིམས་སྲུང་ངོ་།
en: They maintain discipline for the sake of establishing samādhi, wisdom, and liberation among all sentient beings.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཚུལ་ཁྲིམས་མ་ཉམས་པ་དང་། སྐྱོན་མེད་པ་དང་། མ་འདྲེས་པ་དང་། མ་འཁྲུགས་པར་འདོད་པའི་ཕྱིར་ཚུལ་ཁྲིམས་སྲུང་ངོ་།
en: They maintain discipline out of the desire for all sentient beings’ discipline to be unflagging, faultless, uncontaminated, and undisturbed.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྲིན་ཆེན་སྙིང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་དེ་བཞིན་གཤེགས་པའི་མཚན་གྱི་སླད་དུ་ཚུལ་ཁྲིམས་མི་སྲུང་ངོ་ཞེས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་ཅི་ལས་དགོངས་ཏེ་དེ་སྐད་གསུངས།
en: Then the bodhisattva mahāsattva Great Cloud Essence addressed the Bhagavān, asking, “What did the Bhagavān Tathāgata mean when he said that ‘bodhisattvas who abide in this samādhi do not maintain discipline for the sake of the marks of the Tathāgata’?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྤྲིན་ཆེན་སྙིང་པོ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་བསྒྲུབ་པ་དེ་དག་ཐམས་ཅད་ཡོད་པའི་ཕྱིར་རོ།
en: The Bhagavān replied, “Great Cloud Essence, this is because all the accomplished qualities of a buddha exist within bodhisattvas who abide in this samādhi.

source: ཏིང་ངེ་འཛིན་འདི་ནི་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་ཡིན་པའི་ཕྱིར་རོ།
en: Because this samādhi is the source from which all the Buddha’s qualities arise.

source: །སྤྲིན་ཆེན་སྙིང་པོ་དཔེར་ན་ནོར་བུ་རིན་པོ་ཆེ་བཻ་དཱུརྱ་དུ་མ་དང་། ནོར་ཐམས་ཅད་ཀྱི་བདག་པོར་གྱུར་པ་དེ་བདག་ཉིད་ལ་ཡོད་བཞིན་དུ་བཻ་དཱུརྱའི་ཕྱིར་འདོད་པའི་སེམས་དང་ཐེ་ཙོམ་སྐྱེད་པར་འགྱུར་རམ།
en: To give an analogy, Great Cloud Essence, it is like one who has gained ownership of a multitude of precious stones of beryl and all manner of wealth. Would that person give rise to doubts or thoughts of desire for beryl that is like that which they already possess?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ།
en: No, Bhagavān.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་བདག་ཉིད་ལ་ཡོད་བཞིན་དུ་མཚན་གྱི་ཕྱིར་འདོད་པའི་སེམས་སྐྱེད་པ་དེ་ནི་གནས་མེད་དོ།
en: The Bhagavān continued, “It is unfounded to say that bodhisattvas who abide in this samādhi give rise to thoughts of desire for marks that are like those that they already possess.

source: །སྤྲིན་ཆེན་སྙིང་པོ་ཏིང་ངེ་འཛིན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བསམ་གྱིས་མི་ཁྱབ་པའི་ཡུལ་དང་ཡོན་ཏན་ཐམས་ཅད་དང་ལྡན་པར་རིག་པར་བྱའོ། །
en: Great Cloud Essence, you should know that the bodhisattvas who abide in this samādhi are endowed with inconceivable domains and virtuous qualities.” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཅི་བགྱི་བ་མཐར་ཕྱིན་པ་དང་ལྡན་པ་ལགས་པར་རིག་པར་བགྱིའམ།
en: Bhagavān, should they be known as ones who have concluded all activities?” “

source: བཀའ་སྩལ་པ། སྤྲིན་ཆེན་སྙིང་པོ་དེ་སྐད་མ་ཟེར་ཅིག །
en: Great Cloud Essence, do not say this.

source: འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་གང་གི་ཚེ་སེམས་ཅན་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་བྱས་པ་ན་བྱ་བ་མཐར་ཕྱིན་པར་འགྱུར་ཏེ།
en: Bodhisattvas who abide in this samādhi will have finished all activities only when all sentient beings have become complete and perfect buddhas, attaining unsurpassed, complete, and perfect awakening.

source: དེའི་ཚེ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་བྱ་བ་ཐམས་ཅད་མཐར་ཕྱིན་པར་འགྱུར་རོ།
en: At that time, bodhisattvas who abide in this samādhi will have concluded all their activities.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་གང་དག་ཏིང་ངེ་འཛིན་འདིའི་ཡུལ་བཤད་པ་ཐོས་ནས་སྤོང་བར་མི་བགྱིད་པ་ནི་ཀྱེ་མ་ངོ་མཚར་ཏེ།
en: Ah, Bhagavān, how wonderful are those who do not turn away from this samādhi after hearing such an explanation of its domain!

source: སེམས་ཅན་དེ་དག་ནི་མྱ་ངན་དུ་བགྱི་མི་འཚལ་བ་ལགས་སོ། །
en: Those are sentient beings who do not seek to engage in suffering.” “

source: བཀའ་སྩལ་པ། སྤྲིན་ཆེན་སྙིང་པོ་དེ་དེ་བཞིན་ཏེ།
en: So it is, Great Cloud Essence.

source: མ་འོངས་པའི་དུས་ན་ཏིང་ངེ་འཛིན་བསྟན་པ་འདི་བཤད་པ་ན་གང་དག་སྤོང་བར་མི་བྱེད་པའི་སེམས་ཅན་དེ་དག་ལ་ནི་མྱ་ངན་བྱ་མི་དགོས་སོ།
en: In the future, those sentient beings who hear explanations of this samādhi and do not turn away from it will not need to engage in suffering.

source: །འདི་ལྟ་སྟེ། དཔེར་ན་རྒྱལ་པོའི་བུ་རིགས་ཆེ་ཤིང་སྟོབས་དང་ལྡན་ལ་འཁོར་སྙིང་ཉེ་བ་དང་། ཚུལ་དུ་བསྲུང་བར་བྱ་བ་དང་། ཡོན་ཏན་དང་ལྡན་ཞིང་རྒྱལ་པོ་ཆེན་པོར་དབང་བསྐུར་བའི་སྤུ་ལ་བབ་པ་ནི་གནས་དམའ་བའི་ལས་ལ་འདོད་པའི་སེམས་མི་སྐྱེད་དེ། རྒྱ་ཆེན་པོའི་རྒྱལ་སྲིད་ཀྱི་གནས་ལ་སེམས་སོ།
en: To give an analogy, it is like a powerful prince from a great family who is surrounded by close relatives and guardians, endowed with virtuous qualities, and fit to be empowered as a great king. He does not give rise to the thought that he would prefer to belong to a lower level of society. He knows that his status is that of a ruler of a great kingdom.

source: །དེ་བཞིན་དུ་ཏིང་ངེ་འཛིན་བསྟན་པ་འདི་བཤད་པ་ཐོས་ན་སྤོང་བར་མི་བྱེད་ཅིང་ཁ་ཏོན་དུ་བྱེད་པ་དག་ནི་ཆོས་ཀྱི་ཡོན་ཏན་ཐམས་ཅད་དང་ལྡན་ཞིང་བྱང་ཆུབ་ཆེན་པོར་དབང་བསྐུར་བའི་འོས་ཡིན་ཏེ།
en: Similarly, those who do not turn away upon hearing explanations of this samādhi and recite them aloud—such people are endowed with all the virtuous qualities of Dharma and fit to be empowered as great bodhisattvas.

source: ཏིང་ངེ་འཛིན་འདི་ཐོས་ནས་ཏིང་ངེ་འཛིན་གྱི་མཆོག་འདི་ལས་གཞན་པ་གནས་དམའ་བ་ལ་འདོད་པའི་སེམས་མི་སྐྱེད་དེ་དེ་ནི་གནས་མེད་དོ།
en: Those who have heard of this samādhi do not give rise to the thought that they would prefer others that are of a lower status than this supreme samādhi—it would be baseless to say so.

source: །ཏིང་ངེ་འཛིན་རྒྱ་ཆེན་པོའི་གནས་འདི་ཡང་རྐྱེན་དུ་བབ་པ་ཡིན་ནོ།
en: They are suited for the status of this vast samādhi. “

source: །སྤྲིན་ཆེན་སྙིང་པོ་གཞན་ཡང་དཔེར་ན་གདོལ་པ་ཟོལ་པ་ནི་མཆོད་པ་ཆེན་པོས་དབང་བསྐུར་བའི་འོས་མ་ཡིན་ནོ།
en: Furthermore, Great Cloud Essence, consider, by analogy, those outcasts and rogues who are not fit to be empowered with great offerings.

source: །དེ་བཞིན་དུ་གདོལ་པ་ཟོལ་པ་དང་འདྲ་བའི་སེམས་ཅན་དག་ཀྱང་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་འདིའི་དབང་བསྐུར་བའི་འོས་སུ་མི་འགྱུར་རོ།
en: Similarly, sentient beings who are like outcasts and rogues are not fit for the empowerment of this king of samādhis.

source: ཏིང་ངེ་འཛིན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་པ་ཡིན་པར་རིག་པར་བྱ་བའི་ཕྱིར་རོ།
en: You should know that it is because bodhisattvas who abide in this samādhi have paid veneration to many buddhas. “

source: །སྤྲིན་ཆེན་སྙིང་པོ་གཞན་ཡང་ཏིང་ངེ་འཛིན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཡུལ་ལ་ལྟོས།
en: Furthermore, Great Cloud Essence, behold the domain of the bodhisattvas who abide in this samādhi!

source: ཏིང་ངེ་འཛིན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་། བརྟན་པ་དང་། ཞི་བ་བསྟན་པར་བྱ་བའི་ཕྱིར་ཏིང་ངེ་འཛིན་འདི་མི་ཤེས་པའི་སེམས་ཅན་རྣམས་ལ་ཁོང་དུ་ཆུད་པར་བྱའོ་སྙམ་ནས།
en: Bodhisattva mahāsattvas who abide in this samādhi think, ‘In order to demonstrate the permanence, eternality, stability, and tranquility of the Tathāgata’s qualities, I will take in all sentient beings who do not understand this samādhi.’

source: སེམས་ཅན་གང་དང་གང་ལ་ཅི་དང་ཅིས་དོན་དུ་འགྱུར་བ་དེ་དང་དེ་དག་ལ་དེ་དང་དེ་སྦྱིན་པར་བྱའོ་སྙམ་དུ་དམ་བཅས་ནས་སྨོན་ལམ་གྱི་ཕྱིར་ཚུལ་ཁྲིམས་སྲུང་སྟེ།
en: Thus, they make a vow with the thought that ‘to benefit all sentient beings whenever, wherever, whomever they may be, and by whatever means, I will give whatever to whomever.’ Thus, they maintain discipline for the sake of fulfilling that aspiration. ‘

source: ལག་པ་འདོད་པ་རྣམས་ལ་ནི་ལག་པ་སྦྱིན་ནོ།
en: To those who desire an arm, I will give an arm.

source: །རྐང་པ་འདོད་པ་རྣམས་ལ་ནི་རྐང་པ་སྦྱིན་ནོ།
en: To those who desire a leg, I will give a leg.

source: །མིག་འདོད་པ་རྣམས་ལ་ནི་མིག་སྦྱིན་ནོ།
en: To those who desire an eye, I will give an eye.

source: །ཤ་འདོད་པ་རྣམས་ལ་ནི་ཤ་སྦྱིན་ནོ།
en: To those who desire flesh, I will give flesh.

source: །ཁྲག་འདོད་པ་རྣམས་ལ་ནི་ཁྲག་སྦྱིན་ནོ།
en: To those who desire blood, I will give blood.

source: །རྐང་འདོད་པ་རྣམས་ལ་ནི་རྐང་སྦྱིན་ནོ།
en: To those who desire bones, I will give bones.

source: །ཡན་ལག་རེ་རེ་ནས་འདོད་པ་རྣམས་ལ་ཡང་ཡན་ལག་རེ་རེ་ནས་སྦྱིན་ནོ། །བྲན་ཕོ་དང་།
en: To those who desire every limb, I will give every limb.

source: བྲན་མོ་འདོད་པ་རྣམས་ལ་ཡང་བྲན་དུ་འགྲོ་བར་བར་བྱ་ན་ནོར་རམ་འབྲུ་རྣམས་ཡོངས་སུ་བཏང་བ་ལྟ་ཅི་སྨོས་ཏེ།
en: For those who desire male and female servants, I will act as a servant. How much more must I be willing to give away all my wealth and grain—may it be so!’

source: དེ་ལྟར་གྱུར་ཅིག་ཅེས་དེའི་ཕྱིར་ཚུལ་ཁྲིམས་སྲུང་ངོ་།
en: Thus, they maintain discipline for this purpose. “

source: །གཞན་ཡང་འཇིག་རྟེན་དང་འཐུན་པའི་བྱ་བ་དུ་མ་དག་གིས་སེམས་ཅན་གང་དང་གང་ལ་ཅི་དང་ཅིས་དོན་དུ་འགྱུར་བ་དེ་དང་དེ་ལ་དེ་དང་དེ་སྦྱིན་པར་བྱའོ།
en: Furthermore, through their many actions that engage harmoniously with the world, they give whatever to whomever in order to benefit sentient beings whenever, wherever, whomever they may be, and by whatever means.

source: །མི་དགའ་བ་མེད་པར་ཡོངས་སུ་གཏང་བར་བྱའོ།
en: They give without displeasure.

source: །ཕྱིས་འགྱོད་པ་མེད་པར་སྦྱིན་པར་བྱའོ།
en: They give without regret.

source: །རྣམ་པར་སྨིན་པ་ལ་རེ་བ་མེད་པར་སྦྱིན་པར་བྱའོ།
en: They give without any hopes for the karmic ripening of their actions.

source: །སེམས་ཅན་ལ་ཕན་གདགས་པ་དང་། སེམས་ཅན་ལ་སྙིང་བརྩེ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་རྟག་པ་ཉིད་བསྟན་པའི་ཕྱིར་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྤྱད་དེ། སེམས་ཅན་ཐམས་ཅད་ལ་བསྡུས་ནས་དེ་བཞིན་གཤེགས་པའི་རྟག་པ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱའོ་སྙམ་མོ།
en: With compassion and a desire to help sentient beings, and in order to demonstrate the permanence of the Tathāgata, they engage in the perfection of generosity, thinking, ‘After I have gathered all sentient beings, I will cause them to penetrate the permanence of the Tathāgata.’ “

source: །སྤྲིན་ཆེན་སྙིང་པོ་གཞན་ཡང་ཏིང་ངེ་འཛིན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་དེ་བཞིན་གཤེགས་པའི་རྟག་པ་ཉིད་ཡང་དག་པར་ཁོང་དུ་ཆུད་པར་བྱེད་དོ།
en: Moreover, Great Cloud Essence, bodhisattvas who abide in this samādhi will cause all sentient beings to correctly comprehend the permanence of the Tathāgata.

source: དེ་འདི་སྙམ་དུ་གཞན་གྱི་དོན་གྱི་ཕྱིར་ལག་པ་འམ། རྐང་པ་འམ། བྲན་ཕོ་དང་། བྲན་མོ་ཡང་རུང་སྟེ། སེམས་ཅན་གང་དང་གང་ལ་ཅི་དང་ཅིས་དོན་དུ་འགྱུར་བ་དེ་དང་དེ་སྦྱིན་པར་བྱ་སྟེ།
en: Thinking in this way, for the sake of benefitting others, they give away their arms, legs, male and female servants, or whatever is appropriate, giving whatever is necessary in order to benefit sentient beings whenever, wherever, whomever they may be, and by whatever means.

source: བདག་གི་ལུས་དོན་མེད་པར་མ་གྱུར་པར་སེམས་ཅན་རྣམས་ཀྱི་ལོངས་སྤྱོད་ཀྱི་རྒྱུར་གྱུར་ཅིག་ཅེས་སེམས་སྐྱེད་པར་བྱེད་དོ།
en: Thus, they give rise to the thought, ‘As long as my body is capable of bringing benefit, it must serve as a cause for the enjoyment of sentient beings.’

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཀྱིས་མདོའི་གཞུང་ལུགས་གཞན་དག་ལས་དགེ་སློང་དག་མིའི་ལུས་ནི་ཤག་ཤིག་ཏུ་གྱུར་པ་ལྟ་བུ་རྣག་ཅན་གྱི་ལུས་ཡིན་ཏེ།
en: ” “Bhagavān, in the text of other discourses, it is said, ‘Monks, this human body is a decaying body filled with pus.

source: རྫ་མཁན་གྱི་ཕུབ་མ་མི་གཅེས་པ་བོར་བཞིན་དུ་དགོས་པའི་དོན་དག་ལ་དོན་དུ་འགྱུར་བ་མེད་དོ་ཞེས་བཀའ་སྩལ་ན།
en: Like the unwanted scraps discarded by a potter, it is useless for fulfilling any desired purposes.’

source: འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔས་བདག་གི་ལུས་དོན་མེད་པར་མ་གྱུར་ཅིག་ཅེས་ལུས་ཡོངས་སུ་གཏོང་ངོ་ཞེས་བགྱི་བ་བཅོམ་ལྡན་འདས་ཀྱིས་ཅི་ལས་དགོངས་ཏེ་དེ་སྐད་གསུངས།
en: If this is the case, then bodhisattvas who abide in this samādhi should completely relinquish their bodies, thinking, ‘My body is incapable of bringing benefit.’ Bhagavān, what did you mean when you said this?” “

source: བཀའ་སྩལ་པ། སྤྲིན་ཆེན་སྙིང་པོ་དེ་ལྟར་མ་ལྟ་ཤིག་ཏིང་ངེ་འཛིན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ནི་ཆོས་ཀྱི་ལུས་སོ།
en: Great Cloud Essence, you should not see it this way. The bodies of bodhisattvas who abide in this samādhi are Dharma bodies.

source: འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ནི་རུས་པ་དང་། ཤ་དང་། ཁྲག་འདུས་པ་མ་ཡིན་ཏེ། ཆོས་ཀྱི་དབྱིངས་ཡིན་པས་ན་ཆོས་ཀྱི་ལུས་ཡིན་གྱི་ཤའི་ལུས་མ་ཡིན་ནོ་ཞེས་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ།
en: The bodies of bodhisattvas who abide in this samādhi are not compounded from bones, flesh, and blood but rather from the Dharma realm. Therefore, you should produce the perception that ‘they are Dharma bodies, not flesh bodies.’

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་ཅི་ལས་དགོངས་ཏེ། ཆོས་ཀྱི་ལུས་ཡིན་གྱི་ཤའི་ལུས་མ་ཡིན་ནོ་ཞེས་དེ་སྐད་བསྟན་པ་མཛད།
en: ” “Bhagavān, what does the Tathāgata mean by giving a teaching that states that ‘they are Dharma bodies, not flesh bodies’?

source: གལ་ཏེ་ཆོས་ཀྱི་ལུས་ལགས་ན་ནི་སེམས་ཅན་རྣམས་ལ་ཡང་དགོས་པར་མི་འགྱུར་རོ།
en: If bodhisattvas possess Dharma bodies, then they cannot work for the sake of sentient beings.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: For what reason?

source: གཞུང་ལུགས་གཞན་དག་ལས་བཅོམ་ལྡན་འདས་ཀྱིས་ནམ་མཁའི་བྱ་རྗེས་ནི་ཤིན་ཏུ་བསྒྲིམས་ཏེ་བཙལ་ཀྱང་རྙེད་པར་མི་འགྱུར་རོ་ཞེས་བཀའ་སྩལ་ཏེ།
en: In other scriptural texts it is said that ‘the Bhagavān replied that “even if you search for the trail of a bird in the sky with the utmost concentration, you will not find it.”

source: དེ་ལྟ་ལགས་པས་གལ་ཏེ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་དེ་འདྲ་བ་ཞིག་ཏུ་གྱུར་ན། དེ་ལྟ་བུའི་མཚན་ཉིད་ཀྱི་ཆོས་ཀྱི་ལུས་ལ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཀྱང་ནམ་མཁའི་བྱའི་རྗེས་བཞིན་དུ་གཞོམ་པ་འམ་དབྱེ་བར་མི་ནུས་སོ།
en: ’ This being the case, if bodhisattvas who abide in this samādhi solely develop bodies like this, then their Dharma bodies—with such characteristics—will be like the trail of a bird in the sky, incapable of being destroyed or broken apart by sentient beings.” “

source: །བཀའ་སྩལ་པ། སྤྲིན་ཆེན་སྙིང་པོ་དེ་སྐད་མ་ཟེར་ཅིག །
en: Great Cloud Essence, do not say this.

source: འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་སེམས་ཅན་རྣམས་ལ་དགོས་པ་དེ་ནི་བྱིན་གྱིས་བརླབས་པའི་ལུས་ཡིན་པར་ངེས་པར་རིག་པར་བྱའོ།
en: Bodhisattvas who abide in this samādhi can indeed work for the sake of sentient beings. You should know with certainty that this is because they have empowered manifestation bodies.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་ཅི་ལས་དགོངས་ཏེ་བྱིན་གྱིས་བརླབས་པའི་ལུས་ཡིན་ནོ་ཞེས་གསུང་།
en: Bhagavān, what does the Tathāgata mean by saying that ‘they have empowered manifestation bodies’?

source: གལ་ཏེ་བྱིན་གྱིས་བརླབས་པའི་ལུས་ལགས་ན་ནི་སེམས་ཅན་རྣམས་ལ་སྩལ་བ་ན་ཡང་འདི་ལྟར་ཆོས་ཀྱི་ལུས་སུ་བཞག་པས་དེར་འགལ་བ་ཆེན་པོར་འགྱུར་རོ།
en: If they have empowered manifestation bodies, then they would have to put their Dharma bodies aside in order to minister to sentient beings, and that would be a great contradiction.

source: །ཀྱེ་མ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཤའི་ལུས་སེམས་ཅན་རྣམས་ལ་སྩོལ་བར་བགྱིད་དོ་ཞེས་གདའ་བས་ན་ཤོ་བེ་ལགས་སོ་ཞེས་མཆི་བར་འགྱུར་རོ།
en: If one were to maintain, ‘Ah, those bodhisattvas who abide in this samādhi minister to sentient beings with flesh bodies,’ then I would say that this is a false statement.” “

source: །བཀའ་སྩལ་པ། སྤྲིན་ཆེན་སྙིང་པོ་དེ་སྐད་མ་ཟེར་ཅིག་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་བྱིན་གྱིས་བརླབས་པ་གང་ཡིན་པ་དེ་ནི་སྒྱུ་མ་མཁན་གྱིས་སྤྲུལ་པའི་ལུས་བཞིན་དུ་བལྟ་བར་བྱའོ། །
en: Great Cloud Essence, do not say this. The empowered manifestation bodies of bodhisattvas who abide in this samādhi should be seen as being just like the emanation bodies created by illusionists.” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་ཅི་ལས་དགོངས་ཏེ་ཕྱིན་ཅི་ལོག་གི་འདུ་ཤེས་དང་། ཕྱིན་ཅི་མ་ལོག་པའི་འདུ་ཤེས་དང་། ཉོན་མོངས་པ་ཅན་གྱི་ཆོས་དང་། ཉོན་མོངས་པ་ཅན་མ་ཡིན་པའི་ཆོས་ཞེས་ཡང་དང་ཡང་དུ་དེ་སྐད་གསུང་།
en: Bhagavān, what does the Tathāgata mean by speaking again and again of mistaken conceptions and unmistaken conceptions, defiled phenomena and undefiled phenomena?” “

source: བཀའ་སྩལ་པ། སྤྲིན་ཆེན་སྙིང་པོ་དེ་ལྟར་རྣམ་པ་གཞན་དུ་མ་སེམས་ཤིག །
en: Great Cloud Essence, you should think in no other terms than these.

source: འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་བྱིན་གྱིས་བརླབས་པ་གང་ཡིན་པ་དེ་དག་ནི་རྩིའི་སྡོང་བུ་ལྟ་བུའི་ལུས་ཡིན་ནོ།
en: Bodhisattvas who abide in this samādhi, who possess empowered manifestation bodies, have bodies that are like medicinal trees.

source: །འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་རྩྭ་དང་། རྩིག་པ་དང་། ཤིང་དང་། བོང་བ་དང་། མིག་ཡོར་ལྟ་བུར་བསྒོམ་སྟེ།
en: Bodhisattvas who abide in this samādhi should meditate upon being like grass, like rubble, like trees, like dirt, or like apparitions.

source: ཀྱེ་མ་བདག་གི་ལུས་ནི་སྤྱོད་པ་མེད་ཅིང་བྱེད་པ་མེད་པ་སྟེ།
en: They should meditate, ‘Ah! This body of mine has no conduct and no actions.

source: སེམས་མེད་པ་ཅན། སྙིང་པོ་མེད་པའི་ལུས། ཁམས་སུ་མ་གཏོགས་པ་སྟེ།
en: It is a body with no mind and no heart and that is not included among the elements.

source: ཅི་སྟེ་འདི་ལ་ལ་ལ་ཞིག་གཅོད་པར་བྱེད་དམ། འབྱེད་པར་བྱེད་དམ། འཕྲོག་པར་བྱེད་དམ། རྐུ་བར་བྱེད་ཀྱང་རུང་སྟེ། བདག་གི་ལུས་རྩིའི་སྡོང་བུ་ལྟར་དོན་མེད་པར་མ་གྱུར་ཅིག་ཅེས་སྒོམ་པར་བྱེད་དོ།
en: Even if someone were to cut it up, divide it up, kidnap it, or steal it, this body of mine that is like a medicinal tree would not be incapable of bringing benefit.’

source: ཆོས་ཀྱི་ལུས་སུ་བཞག་པའི་ཕྱིར་རོ།
en: Because it has been established as a Dharma body. “

source: །སྤྲིན་ཆེན་སྙིང་པོ་གཞན་ཡང་དཔེར་ན་རྩིའི་སྡོང་བུ་དེའི་རྩ་བ་ཁྱེར་ན་ཡང་འདི་སྙམ་དུ་བདག་གི་རྩ་བ་ཁྱེར་རོ་སྙམ་དུ་མི་སེམས་སོ། །ཤུན་ལྤགས་སམ། པྲིའམ། ལོ་མའམ། མེ་ཏོག་གམ། འབྲས་བུ་འམ། མགོ་ཏོགས་སམ། སྡོང་བུ་འམ། ཡལ་ག་འམ། བུར་མ་འམ། རྩ་བ་དག་ཁྱེར་ཡང་རུང་སྟེ། དེ་འདི་སྙམ་དུ་བདག་གི་ཤུན་ལྤགས་ཁྱེར་རོ། །བདག་གི་པྲི་ཁྱེར་རོ། །བདག་གི་ལོ་མ་ཁྱེར་རོ། །སྙམ་དུ་མི་སེམས་སོ།
en: Furthermore, Great Cloud Essence, it is like the roots of a medicinal tree. When they are taken away, the tree does not think, ‘My roots have been taken away.’ Whether its stalks, or its bark, or its shoots, or its leaves, or its flowers, or its fruits, or its buds, or its trunk, or its branches, or its sap, or its roots are taken, it does not think, ‘My stalks have been taken, my bark has been taken, my shoots have been taken, my leaves have been taken.’

source: །དེ་བཞིན་དུ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་རྩིའི་སྡོང་བུ་ལས་ལག་པ་ཁྱེར་རམ། རྐང་པ་ཁྱེར་རམ། མིག་ཁྱེར་རམ། ཤ་ཁྱེར་རམ། ཁྲག་ཁྱེར་རམ། རྐང་ཁྱེར་རམ། ཡན་ལག་རེ་རེ་ནས་ཁྱེར་རམ། བྲན་ཕོ་དང་། བྲན་མོ་ཁྱེར་རམ། ནོར་རམ་འབྲུ་ཁྱེར་ཡང་དེ་འདི་སྙམ་དུ་བདག་གི་ལག་པ་ཁྱེར་རོ། །བདག་གི་རྐང་པ་ཁྱེར་རོ། །བདག་གི་མིག་ཁྱེར་རོ། །བདག་གི་ཤ་ཁྱེར་རོ། །བདག་གི་ཁྲག་ཁྱེར་རོ། །བདག་གི་རྐང་ཁྱེར་རོ། །བདག་གི་ཡན་ལག་རེ་རེ་ནས་ཁྱེར་རོ། །བདག་གི་བྲན་ཕོ་དང་། བྲན་མོ་ཁྱེར་རོ། །
en: Similarly, for bodhisattvas who abide in this samādhi, their bodies are like medicinal trees. When an arm is taken, or a leg, or an eye, or flesh, or blood, or bones, or every limb, or male and female servants, or wealth, or grain is taken, they do not think, ‘My arm has been taken, my leg has been taken, my eye has been taken, my flesh has been taken, my blood has been taken, my bones have been taken, each of my limbs have been taken, my male and female servants have been taken, my wealth and grain have been taken.’

source: བདག་གི་ནོར་དང་འབྲུ་ཁྱེར་རོ་སྙམ་དུ་མི་སེམས་ཏེ། དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་ནད་བསལ་བའི་ཕྱིར་ཞུགས་པ་ཡིན་ནོ།
en: This is because they have undertaken to clear away all sentient beings’ illnesses of desire, anger, and ignorance.
